api/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def current_user
        if decoded_token
            user_id = decode_token[0]['user_id']
            @user = User.find_by(id: user_id)