api/app/controllers/auths_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "nyokabi@gmail.com"], ["LIMIT", 1]]
---
    def create
        @user = User.find_by(email: login_params[:email])