api/app/controllers/products_controller.rb

INSERT INTO "products" ("image", "description", "unit_price", "quantity", "total", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        if current_user
            @product = Product.create(product_params)